testCase/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (6 2 0)
    (-10 2 0)
    (-10 -2 0)
    (6 -2 0)
    (6 2 2)
    (-10 2 2)
    (-10 -2 2)
    (6 -2 2)
);

blocks
(
//    hex (0 1 2 3 4 5 6 7) (200 36 120) simpleGrading (1 1 1)
    hex (0 1 2 3 4 5 6 7) (80 20 10) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (0 4 7 3)
    )
    patch outlet
    (
        (2 6 5 1)
    )
    patch farfield
    (
        (3 7 6 2)
        (1 5 4 0)
    )
    patch freesurface
    (
        (0 3 2 1)
    )
    patch bottom
    (
        (7 4 5 6)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
