testCase/constant/surface/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "0.001/surface/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    farfield
    {
        type            patch;
        nFaces          152;
        startFace       10925;
    }
    inlet
    {
        type            patch;
        nFaces          36;
        startFace       11077;
    }
    outlet
    {
        type            patch;
        nFaces          36;
        startFace       11113;
    }
    hull
    {
        type            wall;
        inGroups        1(wall);
        nFaces          274;
        startFace       11149;
    }
    freesurface_zone_top
    {
        type            patch;
        nFaces          5522;
        startFace       11423;
    }
    region0_to_surface_freesurface_zone
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          5522;
        startFace       16945;
        sampleMode      nearestPatchFace;
        sampleRegion    region0;
        samplePatch     region0_to_surface_freesurface_zone;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
5522
(
(4.44089e-16 0 0)
(4.44089e-16 0 6.16298e-33)
(-2.22045e-16 0 0)
(0 -6.93889e-18 2.31112e-33)
(2.22045e-16 0 -3.08149e-33)
(2.22045e-16 5.55112e-17 -6.16298e-33)
(0 0 -6.16298e-33)
(2.22045e-16 -2.77556e-17 3.08149e-33)
...
)
;
    }
)

// ************************************************************************* //
