testCase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
//        type            fixedValue;
//        value           uniform (0 0 0);
    }
    farfield
    {
        type            zeroGradient;
//        type            fixedValue;
//        value           uniform (0 0 0);
    }
    hull
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    freesurface
    {
        type            zeroGradient;
    }
    region0_to_surface_freesurface_zone
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
