testCase/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    bottom
    {
        type            fixedValue;
        value           uniform 0;
//        type            zeroGradient;
    }
    farfield
    {
        type            fixedValue;
        value           uniform 0;
//        type            zeroGradient;
    }
    hull
    {
        type            zeroGradient;
    }
    freesurface
    {
        type            fixedValue;
        value           uniform 0;
    }
    region0_to_surface_freesurface_zone
    {
//        type            zeroGradient;
        type            freeSurfacePressure;
        solveFreeSurface yes;
        value           uniform 0;
    }
}


// ************************************************************************* //
