testCase/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | OpenFOAM (Engys Edition):                                |
|   o   O   o      | Version: 2.2_engysEdition-beta                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(nuTilda)   cellLimited Gauss linear 1;
    grad(zeta)      cellLimited Gauss linear 1;
}

divSchemes
{
    default         Gauss linear;
    div(phi,U)      bounded Gauss linearUpwind grad(U);
    div(phi,zeta)   Gauss linearUpwind grad(zeta);
    div(phi,nuTilda) bounded Gauss linearUpwind grad(nuTilda);
}

interpolationSchemes
{
    default         linear;
    interpolate(HbyA) linear;
}

laplacianSchemes
{
//    default         Gauss linear limited corrected 0.2;
    default         Gauss linear corrected;
}

snGradSchemes
{
    default         limited corrected 0.2;
}

fluxRequired
{
    default         no;
    pcorr           ;
    p               ;
}


// ************************************************************************* //
