testCase/system/extrudeToRegionMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeToRegionMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

region          surface;

faceZones       (freesurface_zone);

oneD            false;

sampleMode      nearestPatchFace;

extrudeModel    linearNormal;

nLayers         1;

expansionRatio  1;

adaptMesh       true; // mapped for both

linearNormalCoeffs
{
    thickness       0.025;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
