testCase/system/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "0.001/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    bottom
    {
        type            patch;
        nFaces          2736;
        startFace       1202574;
    }
    farfield
    {
        type            patch;
        nFaces          3496;
        startFace       1205310;
    }
    inlet
    {
        type            patch;
        nFaces          828;
        startFace       1208806;
    }
    outlet
    {
        type            patch;
        nFaces          828;
        startFace       1209634;
    }
    hull
    {
        type            wall;
        inGroups        1(wall);
        nFaces          15306;
        startFace       1210462;
    }
    region0_to_surface_freesurface_zone
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          13145;
        startFace       1225768;
        sampleMode      nearestPatchFace;
        sampleRegion    surface;
        samplePatch     region0_to_surface_freesurface_zone;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
13145
(
(-6.66134e-16 -0 -6.16298e-33)
(-2.22045e-16 -0 3.08149e-33)
(-6.66134e-16 -0 -0)
(-6.66134e-16 -0 1.92593e-34)
(-0 -0 -3.08149e-33)
(-2.22045e-16 -0 -0)
(-4.44089e-16 8.32667e-17 -6.16298e-33)
(2.22045e-16 2.77556e-17 -6.16298e-33)
...
)
;
    }
)

// ************************************************************************* //
